-- example
-- local matrix = {
--   {0,1,1,1,0,1,0,0,0,0,0,1,1,0,0,1,0,0,0,1,0,0,0},
--   {1,0,0,0,0,1,0,0,0,0,1,0,0,1,0,1,0,0,0,1,0,0,0},
--   {1,0,1,1,0,1,0,0,0,0,1,0,0,1,0,1,0,1,0,1,0,0,0},
--   {1,0,0,1,0,1,0,0,0,0,1,0,0,1,0,1,1,0,1,1,0,0,0},
--   {0,1,1,0,0,1,1,1,1,0,0,1,1,0,0,1,0,0,0,1,0,0,0},
--   {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
--   {0,0,3,0,3,0,3,0,0,3,3,3,0,3,0,3,0,3,3,3,0,0,0},
--   {0,0,3,0,3,3,3,0,0,0,3,0,0,3,3,3,0,3,3,0,0,0,0},
--   {0,0,3,0,3,0,3,0,0,0,3,0,0,3,0,3,0,3,3,3,0,0,0},
--   {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
--   {0,0,1,1,1,0,0,0,1,1,0,0,1,1,1,0,0,1,0,0,1,0,0},
--   {0,0,1,0,0,1,0,1,0,0,1,0,1,0,0,1,0,1,0,1,0,0,0},
--   {0,0,1,0,0,1,0,1,1,1,1,0,1,1,1,0,0,1,1,0,0,0,0},
--   {0,0,1,0,0,1,0,1,0,0,1,0,1,0,1,0,0,1,0,1,0,0,0},
--   {0,0,1,1,1,0,0,1,0,0,1,0,1,0,0,1,0,1,0,0,1,0,0}
-- }


local matrix = {
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, 
  {5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5}, -- Внешний оранжевый контур энергии
  {5,6,6,5,6,6,6,5,6,6,5,6,6,6,5,6}, -- Волнообразный переход в желтый
  {6,3,3,6,3,3,3,6,3,3,6,3,3,3,6,3}, -- Белое раскаленное ядро
  {6,3,3,6,3,3,3,6,3,3,6,3,3,3,6,3}, 
  {5,6,6,5,6,6,6,5,6,6,5,6,6,6,5,6}, 
  {5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5}, 
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}, 
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}  
}


-- Функция для преобразования HEX в RGBA формат Aseprite
local function hexToRgba(hex)
  -- Убираем символ #, если он есть
  hex = hex:gsub("#", "")
  
  -- Извлекаем R, G, B компоненты
  local r = tonumber("0x" .. hex:sub(1, 2))
  local g = tonumber("0x" .. hex:sub(3, 4))
  local b = tonumber("0x" .. hex:sub(5, 6))
  
  -- Возвращаем цвет для Aseprite (альфа всегда 255)
  return app.pixelColor.rgba(r, g, b, 255)
end

local colors = {
  -- [0] = "Transparent",
  [1] = hexToRgba("00e5ff"), -- Яркий циан
  [3] = hexToRgba("ffffff"), -- Чистый белый
  [4] = hexToRgba("1f2c3d"), -- Светлый сине-серый (База кнопок UI)
  [5] = hexToRgba("ff9d00"), -- Насыщенный оранжевый
  [6] = hexToRgba("ffe600")  -- Неоново-желтый
}

local h = #matrix
local w = #matrix[1]

-- Создаем новый холст под размер матрицы
local sprite = Sprite(w, h)
app.activeSprite = sprite
local image = sprite.cels[1].image

-- Отрисовываем пиксели
for y = 1, h do
  for x = 1, w do
    local val = matrix[y][x]
    if colors[val] then
      image:drawPixel(x - 1, y - 1, colors[val])
    end
  end
end

app.refresh()